In [32]:
import pandas as pd
import numpy as np
from scipy import stats
import seaborn as sns
import matplotlib.pyplot as plt

In [31]:
movies = pd.read_csv('../data/movies_2015_2024.csv')
movies.head(3)

,Title,Year,Genre,Vote_Average,Vote_Count,Budget,Revenue,TMDB_ID
0,Avengers: Age of Ultron,2015,"['Action', 'Adventure', 'Science Fiction']",7.271,23855,365000000,1405403694,99861
1,Mad Max: Fury Road,2015,"['Action', 'Adventure', 'Science Fiction']",7.627,23511,150000000,378858340,76341
2,Inside Out,2015,"['Animation', 'Family', 'Adventure', 'Drama', ...",7.910,22924,175000000,857611174,150540

In [30]:
best_picture = pd.read_csv('../data/best_picture.csv')
best_picture.head(3) #add column that labels it as nominee

        Title  Awards_Year Winner
0       Wings         1928    Yes
1  7th Heaven         1928     No
2  The Racket         1928     No

## Do Best Picture nominees or winners tend to earn higher box-office revenue than non-nominated movies?

In [11]:
merged_movies = movies.merge(best_picture)
merged_movies.head(5)

,Title,Year,Genre,Vote_Average,Vote_Count,Budget,Revenue,TMDB_ID,Awards_Year,Winner
0,Mad Max: Fury Road,2015,"['Action', 'Adventure', 'Science Fiction']",7.627,23511,150000000,378858340,76341,2015,No
1,The Martian,2015,"['Drama', 'Adventure', 'Science Fiction']",7.691,20590,108000000,631058917,286217,2015,No
2,The Revenant,2015,"['Western', 'Drama', 'Adventure']",7.537,18785,135000000,532950503,281957,2015,No
3,The Big Short,2015,"['Comedy', 'Drama']",7.359,9485,28000000,133346506,318846,2015,No
4,Room,2015,"['Drama', 'Thriller']",7.998,9479,13000000,35401758,264644,2015,No

In [29]:
# First calculate the mean revenue grouped by Winner status
revenue_win_loss = merged_movies.groupby(merged_movies['Winner'] == 'Yes').agg({'Revenue': 'mean'})

# Then format the numbers properly - apply formatting to each value individually
revenue_win_loss = revenue_win_loss.map(lambda x: f'${x:,.0f}')
revenue_win_loss

             Revenue
Winner
False   $247,952,225
True    $169,480,546

## The results show that there is a higher average revenue for non-winning movies.